УправДом/src/Documents/ОплатаТКО/ОплатаТКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаТКО</name>
  <registerRecords>InformationRegister.СведенияПоТКО</registerRecords>
  <attributes>
    <name>ОплачиваемыйМесяц</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КвитанцияИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПлатежа</name>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧеловек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправДом/src/InformationRegisters/СведенияПоТКО/СведенияПоТКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияПоТКО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Норматив</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЧеловек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодМесяцаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОплачиваемыйМесяц</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/Documents/ОплатаТКО/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим) 
	
     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОплатаТКО.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцДокумент,
		|	СведенияПоТКО.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцСведения
		|ИЗ
		|	РегистрСведений.СведенияПоТКО КАК СведенияПоТКО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаТКО КАК ОплатаТКО
		|		ПО СведенияПоТКО.ОплачиваемыйМесяц = ОплатаТКО.ОплачиваемыйМесяц
		|ГДЕ
		|	ОплатаТКО.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Платеж за " + ОплачиваемыйМесяц + " уже проведен";
		Сообщение.Сообщить();;	
	    Отказ = Истина;
	КонецЕсли;

	// регистр СведенияПоТКО
	Движения.СведенияПоТКО.Записывать = Истина;
	Для Каждого ТекСтрокаДанныеПлатежа Из ДанныеПлатежа Цикл
		Движение = Движения.СведенияПоТКО.Добавить();
		Движение.Период = Дата;
		Движение.ОплачиваемыйМесяц = ОплачиваемыйМесяц;
		Движение.Норматив = ТекСтрокаДанныеПлатежа.Норматив;
		Движение.КоличествоЧеловек = ТекСтрокаДанныеПлатежа.КоличествоЧеловек;
		Движение.Цена = ТекСтрокаДанныеПлатежа.Цена;
		Движение.Сумма = ТекСтрокаДанныеПлатежа.СуммаПлатежа;
		Движение.КодМесяцаОплаты = ОплачиваемыйМесяц.Код;
	КонецЦикла;

КонецПроцедуры
